Homework/HW3/HW3-S16.tex
% Created 2016-01-31 Sun 09:46
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage{lmodern}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{amssymb}
\usepackage{amsmath}
\usepackage[version=3]{mhchem}
\usepackage[numbers,super,sort&compress]{natbib}
\usepackage{natmove}
\usepackage{url}
\usepackage{minted}
\usepackage{underscore}
\usepackage[linktocpage,pdfstartview=FitH,colorlinks,
linkcolor=blue,anchorcolor=blue,
citecolor=blue,filecolor=blue,menucolor=blue,urlcolor=blue]{hyperref}
\usepackage{attachfile}
\usepackage[left=1in, right=1in, top=1in, bottom=1in, nohead]{geometry}
\geometry{margin=1.0in}
\usepackage{amsmath}
\usepackage{graphicx}
\usepackage{epstopdf}
\usepackage{fancyhdr}
\usepackage{hyperref}
\usepackage[labelfont=bf]{caption}
\usepackage{setspace}
\setlength{\headheight}{10.2pt}
\setlength{\headsep}{20pt}
\def\dbar{{\mathchar'26\mkern-12mu d}}
\pagestyle{fancy}
\fancyhf{}
\renewcommand{\headrulewidth}{0.5pt}
\renewcommand{\footrulewidth}{0.5pt}
\lfoot{\today}
\cfoot{\copyright\ 2016 W.\ F.\ Schneider}
\rfoot{\thepage}
\chead{\bf{Introduction to Chemical Engineering (CBE 20255)\vspace{12pt}}}
\lhead{\bf{Homework 3}}
\rhead{\bf{Due February 8, 2016}}
\usepackage{titlesec}
\titlespacing*{\section}
{0pt}{0.6\baselineskip}{0.2\baselineskip}
\title{University of Notre Dame\\Introduction to Chemical Engineering\\(CBE 20255)}
\author{Prof. William F.\ Schneider}
\def\dbar{{\mathchar'26\mkern-12mu d}}
\usepackage{siunitx}
\setcounter{secnumdepth}{3}
\author{William F. Schneider}
\date{\today}
\title{CBE 60553 Outline}
\begin{document}

\begin{options}
\end{options}

\noindent \textbf{Solve each problem on a separate sheets of Engineering Computation paper.  Carefully and neatly document your answers. Box your final answer, reporting it with the correct number of significant figures and units.  Use plotting software for all plots.}


\section{\href{https://www.youtube.com/watch?v=YoDh_gHDvkk}{Under Pressure (in memory of Bowie and, of course, Mercury!)}}
\label{sec-1}
Two mercury manometers, one open-ended and one sealed, are attached to an air duct.  The open-end manometer reads 22 mm and the sealed end 800 mm.

\begin{enumerate}
\item (4 pts) What is the absolute pressure in the duct, in mmHg and in atm?

\item (4 pts) What is the gauge pressure in the duct, in mmHg and in Pa?

\item (4 pts) What is the atmospheric pressure, in mmHg and in psi?
\end{enumerate}

\section{Fill me up}
\label{sec-2}
The liquid level in a tank is determined by measuring the pressure at the bottom of the tank.  A calibration curve is prepared by filling the tank to several known levels, reading the bottom pressure using a \href{https://en.wikipedia.org/wiki/Pressure_measurement#Bourdon}{Bourdon gauge}, and plotting level in m vs.~pressure in bar.

\begin{enumerate}
\item (4 pts) Make a sketch of what you expect the calibration curve to look like.  You can do this by hand, but label axes and make sure all important parts of your curve are clear.

\item (4 pts) The calibration was done with a fluid that has a specific gravity of 0.900, but the tank is actually used to store a fluid with a specific gravity of 0.800.  Make a sketch of the actual fluid height vs.~the calibration-curve-predicted height.  Again, you can do this by hand, but pay careful attention to indicate all important features of your curve.

\item (6 pts) The tank is \SI{10}{\meter} tall. What will the Bourdon gauge read (assuming it is working correctly) when the tank overflows, and what will the calibration curve \emph{say} that the liquid height is?
\end{enumerate}

\section{Achieving (mol) balance}
\label{sec-3}
A process stream contains 44.6\%(mol/mol) benzene and 55.4\%(mol/mol) toluene and is fed to a process unit that separates these into a liquid and a vapor stream.  When the unit is started up, the initial vapor flow rate is zero, but it then gradually rises and asymptotically approaches half the total molar flow rate.  No material accumulates in the process unit throughout or after start-up.  After the vapor flow rate becomes constant, the liquid phase is analyzed and found to contain 28.0\%(mol/mol) benzene.

\begin{enumerate}
\item (4 pts) Make a sketch of the liquid and vapor flow rates vs.~time, from start-up until the vapor flow rate is constant.  You can do this by hand, but label axes and make sure all important parts of your curve are clear.
\item (1 pt) Is this process continuous or batch?
\item (2 pt) Is the process transient or steady-state when first started up?  When the vapor stream attains a constant flow rate?
\item (4 pts) Assuming that the feed rate is 100 mol/min, draw and \textbf{fully label} a flowchart for the process after the vapor flow rate has become constant.
\item (4 pts) Use balances to compute the vapor phase composition after the vapor flow rate has become constant.
\end{enumerate}

\section{Achieving (mass) balance}
\label{sec-4}
Soybean oil is extracted from soy beans by first drying and chopping up the beans, and then ``extracting'' the oil from the beans by contacting them with a solvent (like hexane) that draws the oil out and leaves behind the residual bean solids (plus some remaining soybean oil).

\begin{enumerate}
\item (6 pts) The soybeans contain 18.5\%(w/w) oil and balance insoluble solids, and the hexane is fed at a mass flow rate twice that of the beans.  The residual solids stream contains 35.5\%(w/w) hexane, all the insoluble solids, and 1.0\%(w/w) soybean oil.  Dried soybeans are fed at a rate of 1000 kg/hr.  Draw a flowchart of the extraction process, labeling the two input streams (beans and hexane), the two output streams (solids and extract), the known and unknown flow rates, and the known and unknown stream compositions.

\item (6 pts) Calculate all unknown mass flow rates and all unknown mass compositions.

\item (4 pts) After the extraction, the soybean oil must be separated from the hexane.  Sketch a flowchart for such a process.  What would you do with the recovered hexane?
\end{enumerate}

\section{Get in line}
\label{sec-5}
Two distillation columns are connected in series.  A liquid mixture containing 30.0, 25.0, and 45.0 \%(mol/mol) of benzene (B), toluene (T), and xylene (X), respectively, are fed to the first column.  The bottom of the first column collects 96.0\% of the input xylene in a stream that contains 98.0\% xylene and balance toluene.  The top of the first column is fed to the second column.  The top of the second column recovers 97.0\% of the benzene fed to this column in a stream that is 94.0\% benzene and balance toluene.

\begin{enumerate}
\item (6 pts) Draw a process diagram and label all known and unknown flow rates and compositions.  Draw boxes around the parts of the process about which it is possible to do a mass balance.

\item (2 pts) If the flow rate into the first column is known, is it possible to determine the three flow rates out of the overall process?  Use a degree of freedom analysis.

\item (6 pts) Perform a mass balance on the first column.  What is the composition of the stream entering the second column?

\item (6 pts) Perform a mass balance on the second column.  What are the compositions of the stream leaving it?

\item (6 pts) How effective overall is the separation?  That is, what fraction of the benzene entering the first column is recovered out the top of the second?  What fraction of toluene entering the first column is recovered out the bottom of the second?
\end{enumerate}
% Emacs 25.0.50.1 (Org mode 8.2.10)
\end{document}